app/controllers/messages_controller.rb

  def create
    user = User.find_by_email(message_params[:receiver_email]) #find user by email instead of id
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "vinicius.alves.porto@gmail.com"], ["LIMIT", 1]]